Repository: johnpetersa19/lfy
Catalog: po/*.po
Languages: it

source: translator_credits
it: Albano Battistella <albanobattistella@gmail.com>, 2024

source: A translation app for GNOME.
it: Un'app di traduzione per GNOME.

source: Next translation without splicing text
it: Prossima traduzione senza giuntare il testo

source: Next translation splicing text
it: Prossima traduzione del testo di giunzione

source: Copy automatic translation, it is recommended to pin this window to the top
it: Copia la traduzione automatica, si consiglia di fissare questa finestra in alto

source: The connection timed out. Maybe there is a network problem
it: La connessione è scaduta. Forse c'è un problema di rete

source: something error, try other translate engine?
it: si è verificato un errore, provare un altro motore di traduzione?

source: Not supported This Server!
it: Questo server non è supportato!

source: save success!
it: salvataggio avvenuto con successo!

source: Automatic
it: Automatico

source: Chinese
it: Cinese

source: Classical Chinese
it: Cinese Classico

source: English
it: Inglese

source: Japanese
it: Giapponese

source: Korean
it: Coreano

source: German
it: Tedesco

source: French
it: Francese

source: please input app_id and secret_key like:
it: per favore inserisci app_id e secret_key come:

source: please input API Key in preference
it: si prega di inserire la chiave API come preferenza

source: something error:
it: qualche errore:

source: please input secret_id and secret_key like:
it: per favore inserisci secret_id e secret_key come:

source: Remove symbols such as line breaks
it: Rimuovi simboli come interruzioni di riga

source: Splice the next copied text with the previous text
it: Unisci il successivo testo copiato con il testo precedente

source: translate
it: Traduzione

source: Menu
it: Menù

source: _Preferences
it: _Preferenze

source: _Keyboard Shortcuts
it: _Scorciatoie da tastiera

source: _About lfy
it: _Informazoni su lfy

source: Translate Server
it: Traduci Server

source: how to get API Key
it: come ottenere la chiave API

source: API Key,Pay attention to whether there are dividing lines |
it: Chiave API,Prestare attenzione se ci sono linee di demarcazione |

source: Enter an API Key for the Server.
it: Inserisci una chiave API per il server.

source: setup API Key for translation Server, click on the right to the details
it: imposta la chiave API per il server di traduzione, fai clic a destra per i dettagli

source: API Key
it: Chiave API

source: auto check update
it: aggiornamento del controllo automatico

source: Automatically check for updates when opening software
it: Controlla automaticamente gli aggiornamenti all'apertura del software

source: vpn addr and port, like http://127.0.0.1:7890
it: indirizzo e porta VPN, come http://127.0.0.1:7890

# shortcut window
source: General
it: Generale

source: Translate
it: Tradurre

source: Splice Text
it: Testo di giunzione

# shortcut window
source: Quit
it: Uscita

# shortcut window
source: Show Shortcuts
it: Mostra scorciatoie
